<a href="https://colab.research.google.com/github/Shivaram17/100DaysOfAdvancedPythonCoding/blob/main/10063AdvancedPython_Pandas_Series_Dataframe.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
 # Linear algebra numpy 
 import numpy as np
 x = np.array([[1,2,3], [4,5,6]])
 y = np.array([[5,10], [4,8], [2,6]])
 
 # np.dot 2,3 dot 3,2 = 2,2
 np.dot(x,y)
 y.dot(x)

 from numpy.linalg import inv, qr
 arr = np.random.rand(5,4)
 # The expression X.T.dot(X) computes the dot product of X with its transpose X.T. transpose and inverse
 mat = arr.T.dot(arr)
 
 # inverse
 inv(mat)
 # determinat of a matrix
 np.linalg.det(mat)

0.00763676228238611

In [6]:
# pandas series isnull and notnull
import pandas as pd

sdata = {'Ohio':3500, 'Texas': 5000, "Delhi": 2000, 'Hyderabad': 4000}
obj = pd.Series(sdata)

states = ['Chennai', 'Texas', 'Delhi', 'Hyderabad', 'Ontario']

obj2 = pd.Series(sdata, index = states)
pd.isnull(obj2)
pd.notnull(obj2)

Chennai      False
Texas         True
Delhi         True
Hyderabad     True
Ontario      False
dtype: bool

In [24]:
import pandas as pd
data = {'State': ['Chennai', 'Texas', 'Delhi', 'Hyderabad', 'Ontario'],
        'Year': [2000, 2001, 2002, 2003, 2004],
        'pop': [1,2,3,4,5]
        }

frame = pd.DataFrame(data)
frame.loc[1]

# add new column
frame2 = pd.DataFrame(data, columns = ['State', 'Year', 'pop', 'Accounting'],
                      index = ['one', 'two', 'three', 'four', 'five'])
frame2['debt'] = 'Citi Bank'
frame2

           State  Year  pop Accounting       debt
one      Chennai  2000    1        NaN  Citi Bank
two        Texas  2001    2        NaN  Citi Bank
three      Delhi  2002    3        NaN  Citi Bank
four   Hyderabad  2003    4        NaN  Citi Bank
five     Ontario  2004    5        NaN  Citi Bank